/**
 * .pop() - удаляет последний элемент из массива и возвращает его значение.
 *
 * Параметры: .pop()
 *
 * Примеры:
 */

const myFish = ["ангел", "клоун", "мандарин", "хирург"];

console.log(myFish); // ['ангел', 'клоун', 'мандарин', 'хирург']

const popped = myFish.pop();

console.log(myFish); // ['ангел', 'клоун', 'мандарин']

console.log(popped); // 'хирург'

const myArr = ["ангел", "клоун", "мандарин", "хирург", "кот", "машина"];

console.log(myArr.pop()); //  "машина";
console.log(myArr); //  "ангел", "клоун", "мандарин", "хирург", "кот";
